Autodesk.Revit.DB.ThermalMaterialType
Since:
2013
Represents the thermal material type.
Since:
2013

Autodesk.Revit.DB.ThermalMaterialType.Solid
Thermal material type is solid.

Autodesk.Revit.DB.ThermalMaterialType.Liquid
Thermal material type is liquid.

Autodesk.Revit.DB.ThermalMaterialType.Gas
Thermal material type is gas.

Autodesk.Revit.DB.ThermalMaterialType.Undefined
Thermal material type is undefined.